tests/fileio/output/2020-12-21T12:15:08+0000-metal-fileio.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4710.77
    fsyncs/s:                     6030.48

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.61

General statistics:
    total time:                          30.0124s
    total number of events:              322285

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.49
         95th percentile:                        0.09
         sum:                                29741.10

Threads fairness:
    events (avg/stddev):           322285.0000/0.00
    execution time (avg/stddev):   29.7411/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4693.14
    fsyncs/s:                     6007.55

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.33

General statistics:
    total time:                          30.0186s
    total number of events:              321134

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.50
         95th percentile:                        0.09
         sum:                                29743.90

Threads fairness:
    events (avg/stddev):           321134.0000/0.00
    execution time (avg/stddev):   29.7439/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4697.12
    fsyncs/s:                     6012.65

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.39

General statistics:
    total time:                          30.0144s
    total number of events:              321362

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.48
         95th percentile:                        0.09
         sum:                                29743.07

Threads fairness:
    events (avg/stddev):           321362.0000/0.00
    execution time (avg/stddev):   29.7431/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4690.87
    fsyncs/s:                     6005.04

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.29

General statistics:
    total time:                          30.0118s
    total number of events:              320918

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.47
         95th percentile:                        0.09
         sum:                                29734.13

Threads fairness:
    events (avg/stddev):           320918.0000/0.00
    execution time (avg/stddev):   29.7341/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4720.01
    fsyncs/s:                     6041.98

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.75

General statistics:
    total time:                          30.0172s
    total number of events:              322959

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.38
         95th percentile:                        0.10
         sum:                                29753.43

Threads fairness:
    events (avg/stddev):           322959.0000/0.00
    execution time (avg/stddev):   29.7534/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4690.65
    fsyncs/s:                     6004.36

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.29

General statistics:
    total time:                          30.0132s
    total number of events:              320906

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.61
         95th percentile:                        0.09
         sum:                                29742.54

Threads fairness:
    events (avg/stddev):           320906.0000/0.00
    execution time (avg/stddev):   29.7425/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4693.53
    fsyncs/s:                     6008.06

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.34

General statistics:
    total time:                          30.0161s
    total number of events:              321134

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.50
         95th percentile:                        0.09
         sum:                                29739.43

Threads fairness:
    events (avg/stddev):           321134.0000/0.00
    execution time (avg/stddev):   29.7394/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4707.53
    fsyncs/s:                     6026.78

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.56

General statistics:
    total time:                          30.0118s
    total number of events:              322070

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   11.46
         95th percentile:                        0.09
         sum:                                29741.27

Threads fairness:
    events (avg/stddev):           322070.0000/0.00
    execution time (avg/stddev):   29.7413/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4713.98
    fsyncs/s:                     6034.26

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.66

General statistics:
    total time:                          30.0132s
    total number of events:              322503

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   12.18
         95th percentile:                        0.09
         sum:                                29750.66

Threads fairness:
    events (avg/stddev):           322503.0000/0.00
    execution time (avg/stddev):   29.7507/0.00

sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     4706.43
    fsyncs/s:                     6024.57

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               73.54

General statistics:
    total time:                          30.0188s
    total number of events:              322046

Latency (ms):
         min:                                    0.01
         avg:                                    0.09
         max:                                   14.33
         95th percentile:                        0.10
         sum:                                29752.67

Threads fairness:
    events (avg/stddev):           322046.0000/0.00
    execution time (avg/stddev):   29.7527/0.00